package br.conselhos.page.Financeiro;

import br.conselhos.core.BaseTest;

public class CadastrosBasicosPage extends BaseTest {
	
	/*********************************** HISTÓRICOS ***************************************************************************************/
	
	//******************************** Novo Históricos ***********************************************************************************//
	
	
	
	//****************************** Consultar Históricos ********************************************************************************//
	
	
	
	/********************************* TIPOS DE CONTATO ***********************************************************************************/
	
	//****************************** Novo Tipos de Contato *******************************************************************************//
	
	public void tiposDeContato() {
		clicarBotaoSelector("div[title='Tipos de contato']");
	}
	
	//**************************** Consulta Tipos de Contato *****************************************************************************//
	
	
	
	
	/********************************* TIPOS DE DOCUMENTO *********************************************************************************/
	
	//****************************** Novo Tipos de Documento *****************************************************************************//
	
	public void tiposDeDocumento() {
		clicarBotaoSelector("div[title='Tipos de documento");
	}
	
	//***************************** Consulta Tipos de Documento **************************************************************************//
	
	
	
    /******************************** TIPOS DE COBRANÇA ***********************************************************************************/
    
    //***************************** Novo Tipos de Cobrança *******************************************************************************//
	
	public void tiposDeCobranca() {
		clicarBotaoSelector("div[title='Tipos de cobrança']");
	}
	
	//**************************** Consulta Tipos de Cobrança ****************************************************************************//

	
	
	/********************************* TIPOS DE PAGAMENTO *********************************************************************************/
	
	//****************************** Novo Tipos de Pagamento *****************************************************************************//
	
	public void tiposDePagamento() {
		esperaExplicita("div[title='Tipos de Pagamento']");
		clicarBotaoSelector("div[title='Tipos de Pagamento']");
	}
	
	
	
	/********************************* FORMAS LIQUIDAÇÃO **********************************************************************************/
	
	public void formasLiquidacao() {
		esperaExplicita("div[title='Formas liquidação']");
		clicarBotaoSelector("div[title='Formas liquidação']");
	}
	
}
